---
kind: property
id: P:Autodesk.Revit.DB.DocumentVersion.VersionGUID
source: html/5c246fe4-cefa-37da-1bb1-1aa2e39b3c60.htm
---
# Autodesk.Revit.DB.DocumentVersion.VersionGUID Property

The GUID portion of the DocumentVersion. The GUID is updated when changes
 are made to the document, but may not update with every change to the document.
 The GUID and save number are both necessary to uniquely identify a document version.

## Syntax (C#)
```csharp
public Guid VersionGUID { get; }
```